#------------------------------------------

# Program by Nikolay.N.N
#
#
# Version       Date        Info
# 1.0           2020        Initial Version
#
# Student       GeekBrains  Fac:Python

#------------------------------------------

#5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
a = int(input('Введите цифру для определения буквы '))
print(f' Введенное число {a} = букве {chr(a)} ')